taskt/Core/Automation/Commands/FileGroup/IFileExistsFilePathBeforeAfterPathResultProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IFileExistsFilePathBeforeAfterPathResultProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands" [ label="AFileExistsFilePathBeforeAfterResultCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IFileExistsFilePathBeforeAfterPathResultProperties" [ label="IFileExistsFilePathBeforeAfterPathResultProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.AFileCopyMoveFileCommands" [ label="AFileCopyMoveFileCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands" [ label="AFileCopySameRenameFileCommands", style="dashed", ];
"taskt.Core.Automation.Commands.CopyFileCommand" [ label="CopyFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveFileCommand" [ label="MoveFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CopyFileToSameFolderCommand" [ label="CopyFileToSameFolderCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.RenameFileCommand" [ label="RenameFileCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands" -> "taskt.Core.Automation.Commands.IFileExistsFilePathBeforeAfterPathResultProperties";
"taskt.Core.Automation.Commands.AFileCopyMoveFileCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands";
"taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands";
"taskt.Core.Automation.Commands.CopyFileCommand" -> "taskt.Core.Automation.Commands.AFileCopyMoveFileCommands";
"taskt.Core.Automation.Commands.MoveFileCommand" -> "taskt.Core.Automation.Commands.AFileCopyMoveFileCommands";
"taskt.Core.Automation.Commands.CopyFileToSameFolderCommand" -> "taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands";
"taskt.Core.Automation.Commands.RenameFileCommand" -> "taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands";
}
